In [1]:
import mysql.connector as connector

try:
    connection = connector.connect(
        user="root",
        password="rootpass"
    )
    print('Connection established.')
except connector.Error as e:
    print('Unable to establish connection.')
    print(e.msg)

Connection established.

In [2]:
cursor = connection.cursor()

In [3]:
cursor.execute("DROP DATABASE IF EXISTS little_lemon_db")

In [4]:
cursor.execute("CREATE DATABASE little_lemon_db")

In [5]:
cursor.execute("USE little_lemon_db")

In [6]:
create_menu_item = """
CREATE TABLE menu_item (
    item_id INT AUTO_INCREMENT,
    name VARCHAR(200),
    type VARCHAR(100),
    price INT,
    PRIMARY KEY (item_id)
);
"""

create_menu = """
CREATE TABLE menu (
    menu_id INT AUTO_INCREMENT,
    item_id INT,
    cuisine VARCHAR(100),
    PRIMARY KEY (menu_id, item_id)
);
"""

create_booking = """
CREATE TABLE booking (
    booking_id INT AUTO_INCREMENT,
    table_no INT,
    guest_first_name VARCHAR(100) NOT NULL,
    guest_last_name VARCHAR(100) NOT NULL,
    booking_slot TIME NOT NULL,
    employee_id INT,
    PRIMARY KEY (booking_id)
);
"""

create_booking_order = """
CREATE TABLE booking_order (
    order_id INT AUTO_INCREMENT,
    table_no INT,
    menu_id INT,
    booking_id INT,
    bill_amount INT,
    quantity INT,
    PRIMARY KEY (order_id, table_no)
);
"""

create_employee = """
CREATE TABLE employee (
    employee_id INT AUTO_INCREMENT,
    name VARCHAR(255),
    role VARCHAR(100),
    address VARCHAR(255),
    contact_number INT,
    email VARCHAR(255),
    annual_salary VARCHAR(100),
    PRIMARY KEY (employee_id)
);
"""

In [7]:
cursor.execute(create_menu_item)
cursor.execute(create_menu)
cursor.execute(create_booking)
cursor.execute(create_booking_order)
cursor.execute(create_employee)

In [8]:
insert_menu_item = """
INSERT INTO menu_item (name, type, price) VALUES
    ('Olives','Starters',5),
    ('Flatbread','Starters', 5),
    ('Minestrone', 'Starters', 8),
    ('Tomato bread','Starters', 8),
    ('Falafel', 'Starters', 7),
    ('Hummus', 'Starters', 5),
    ('Greek salad', 'Main Courses', 15),
    ('Bean soup', 'Main Courses', 12),
    ('Pizza', 'Main Courses', 15),
    ('Greek yoghurt','Desserts', 7),
    ('Ice cream', 'Desserts', 6),
    ('Cheesecake', 'Desserts', 4),
    ('Athens White wine', 'Drinks', 25),
    ('Corfu Red Wine', 'Drinks', 30),
    ('Turkish Coffee', 'Drinks', 10),
    ('Turkish Coffee', 'Drinks', 10),
    ('Kabasa', 'Main Courses', 17);
"""
cursor.execute(insert_menu_item)
connection.commit()

In [9]:
insert_menu = """
INSERT INTO menu (item_id, cuisine) VALUES
    (1, 'Greek'),
    (7, 'Greek'),
    (10, 'Greek'),
    (13, 'Greek'),
    (3, 'Italian'),
    (9, 'Italian'),
    (12, 'Italian'),
    (15, 'Italian'),
    (5, 'Turkish'),
    (17, 'Turkish'),
    (11, 'Turkish'),
    (16, 'Turkish');
"""
cursor.execute(insert_menu)
connection.commit()

In [10]:
insert_booking = """
INSERT INTO booking (
    table_no, 
    guest_first_name, 
    guest_last_name, 
    booking_slot, 
    employee_id
) VALUES
    (12, 'Anna','Iversen','19:00:00',1),
    (12, 'Joakim', 'Iversen', '19:00:00', 1),
    (19, 'Vanessa', 'McCarthy', '15:00:00', 3),
    (15, 'Marcos', 'Romero', '17:30:00', 4),
    (5, 'Hiroki', 'Yamane', '18:30:00', 2),
    (8, 'Diana', 'Pinto', '20:00:00', 5);
"""
cursor.execute(insert_booking)
connection.commit()

In [11]:
insert_booking_order = """
INSERT INTO booking_order (table_no, menu_id, booking_id, quantity, bill_amount) VALUES
    (12, 1, 1, 2, 86),
    (19, 2, 2, 1, 37),
    (15, 2, 3, 1, 37),
    (5, 3, 4, 1, 40),
    (8, 1, 5, 1, 43);
"""
cursor.execute(insert_booking_order)
connection.commit()

In [12]:
insert_employee = """
INSERT INTO employee (
    name, 
    role, 
    address, 
    contact_number, 
    email, annual_salary
) VALUES 
    ('Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
    ('Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
    ('Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
    ('Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
    ('Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
    ('John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');
"""
cursor.execute(insert_employee)
connection.commit()